#Дана сторона квадрата a.
#Вычислите прощадь квадрата S.


print("Площадь квадрата равна", int(input("Введи сторону квадрата")) ** 2)