def while_1(): # Числа Фибоначи
    pass


def while_2(): # Номер числа Фибоначи
    pass


def while_3(): # Исполнитель "Раздвоитель"
    pass


def while_4(): # Максимальное число идущих подряд элементов
    pass


def while_5(): # Максимальная длинна монотонного фрагмента
    pass


def while_6(): # Количество локальных максимумов
    pass


def while_7(): # Наименьшее растояние между двумя строгими максимумами
    pass


def while_8(): # Стандартное отклонение
    pass


def while_9(): #Исполнитель "Водолей"
    pass