def elif12(number, element):
    """
    Elif12. Элементы окружности пронумерованы следующим образом:
    1 - радиус r, 2 - диаметр d = 2 * r, 3 - длина l = 2 * pi * r, 4 - площадь круга s = pi * r**2 .
    Дан номер одного из этих элементов и его значение.
    Вывести значения остальных элементов данной окружности (в том же порядке). В качестве значения π использовать 3.14.
    """
    if element == 1:
        return(number, number * 2, number * 6.28, 3.14 * number ** 2)
    elif element == 2:
        return(number / 2, number, number / 2 * 6.28, 3.14 * ((number / 2) ** 2))
    elif element == 3:
        l3 = number / 6.28
        return( l3,  l3 * 2,  number, 3.14 * l3 ** 2)
    elif element == 4:
        s4 = (number / 3.14) ** 0.5
        return( s4, s4 * 2,  s4 * 6.28, number)


def elif13(number, element):
    """
    Elif13. Элементы равнобедренного прямоугольного треугольника пронумерованы следующим образом:
    1 - катет a, 2 - гипотенуза c = a * 2**0.5, 3 - высота h, опущенная на гипотенузу (h = c / 2),
    4 - площадь s = c * h / 2. Дан номер одного из этих элементов и его значение.
    Вывести значения остальных элементов данного треугольника (в том же порядке).
    """
    if element == 1:
        c1 = number * (2 ** 0.5)
        return( number,  c1,  c1 / 2,  c1 * (c1 / 4))
    elif element == 2:
        return( number / (2 ** 0.5),  number,  number / 2,  number * (number / 4))
    elif element == 3:
        return( (2 * number) / (2 ** 0.5),  2 * number,  number,  2 * number * (number / 2))
    elif element == 4:
        gipotenusa = (number * 4) ** 0.5
        return( gipotenusa / (2 ** 0.5),  gipotenusa,  gipotenusa / 2,  number)


def elif14(number, element):
    """
    Elif14. Элементы равностороннего треугольника пронумерованы следующим образом:
    1 - сторона a, 2 - радиус r1 вписанной окружности (r1 = a * 3**0.5 / 6),
    3 - радиус r2 описанной окружности (r2 = 2 * r1), 4 - площадь s = a**2 * 3**0.5 / 4.
    Дан номер одного из этих элементов и его значение.
    Вывести значения остальных элементов данного треугольника (в том же порядке)"""

    if element==1:
	    return (number,number*(3**0.5/6),2*number*(3**0.5/6),(number**2)*(3**0.5/4))
    elif element==2:
        r1=number/(3**0.5/6)
        return (r1,number,2*number,r1**2*(3**0.5/4))
    elif element==3:
        r11=(number/2)/(3**0.5/6)
        return (r11,number/2,number,r11*(3**0.5/4))
    elif element==4:
        a=(number/(3**0.5/4))**0.5
        return (a,a*(3**0.5/6),2*a*(3**0.5/6),number)


def elif15(n, m):
    """
    Elif15. Мастям игральных карт присвоены порядковые номера: 1 - пики, 2 - трефы, 3 - бубны, 4 - червы.
    Достоинству карт, старших десятки, присвоены номера: 11 - валет, 12 - дама, 13 - король, 14 - туз.
    Даны два целых числа: n - достоинство (6 ≤ N ≤ 14) и m - масть карты (1 ≤ M ≤ 4).
    Вывести название соответствующей карты вида «шестерка бубен», «дама червей», «туз треф» и т. п.
    """
    if n == 6:
        q = "шестерка "
    elif n == 7:
        q = "семерка "
    elif n == 8:
        q = "восьмерка "
    elif n == 9:
        q = "девятка "
    elif n == 10:
        q = "десятка "
    elif n == 11:
        q = "валет "
    elif n == 12:
        q = "дама "
    elif n == 13:
        q = "король "
    elif n == 14:
        q = "туз "

    if m == 1:
        w = "пики"
    elif m == 2:
        w = "треф"
    elif m == 3:
        w = "бубен"
    elif m == 4:
        w = "червей"
    return q + w


def elif16(years_olds):
    """
    Elif16. Дано целое число в диапазоне 20–69, определяющее возраст (в годах).
    Вывести строку-описание указанного возраста, обеспечив правильное согласование числа со словом «год»,
    например: 20 - «двадцать лет», 32 - «тридцать два года», 41 - «сорок один год».
    """
    if years_olds // 10 == 2:
       q = "двадцать "
    elif years_olds // 10 == 3:
       q = "тридцать "
    elif years_olds // 10 == 4:
       q = "сорок "
    elif years_olds // 10 == 5:
       q = "пятьдесят "
    elif years_olds // 10 == 6:
       q = "шестьдесят "

    if years_olds % 10 == 0:
       q += "лет "
    elif years_olds % 10 == 1:
       q += "один год "
    elif years_olds % 10 == 2:
       q += "два года "
    elif years_olds % 10 == 3:
       q += "три года "
    elif years_olds % 10 == 4:
       q += "четыре года "
    elif years_olds % 10 == 5:
       q += "пять лет "
    elif years_olds % 10 == 6:
       q += "шесть лет "
    elif years_olds % 10 == 7:
       q += "семь лет "
    elif years_olds % 10 == 8:
       q += "восемь лет "
    elif years_olds % 10 == 9:
       q += "девять лет "
    return q


def elif17(int_number):
    """
    Elif17. Дано целое число в диапазоне 10–40, определяющее количество учебных заданий по некоторой теме.
    Вывести строку-описание указанного количества заданий, обеспечив правильное согласование числа со словами
    «учебное задание», например: 18 - «восемнадцать учебных заданий», 23 - «двадцать три учебных задания»,
    31 - «тридцать одно учебное задание».
   """
    q = ""
    if int_number == 10:
       q = "десять"
    elif int_number == 11:
       q = "одиннадцать"
    elif int_number == 12:
       q = "двенадцать"
    elif int_number == 13:
       q = "тринадцать"
    elif int_number == 14:
       q = "четырнадцать"
    elif int_number == 15:
       q = "пятнадцать"
    elif int_number == 16:
       q = "шестнадцать"
    elif int_number == 17:
       q = "семнадцать"
    elif int_number == 18:
       q = "восемнадцать"
    elif int_number == 19:
       q = "девятнадцать"
    w = ""
    if int_number // 10 == 2:
       w = " двадцать"
    elif int_number // 10 == 3:
       w = " тридцать"
    elif int_number // 10 == 4:
       w = " сорок"
    e = ""
    if int_number // 10 == 1:
       e = " учебных заданий"
    elif int_number % 10 == 1:
       e = " одно учебное задание"
    elif int_number % 10 == 2:
       e = " два учебных заданий"
    elif int_number % 10 == 3:
       e = " три учебных заданий"
    elif int_number % 10 == 4:
       e = " четыре учебных заданий"
    elif int_number % 10 == 5:
       e = " пять учебных заданий"
    elif int_number % 10 == 6:
       e = " шесть учебных заданий"
    elif int_number % 10 == 7:
       e = " семь учебных заданий"
    elif int_number % 10 == 8:
       e = " восемь учебных заданий"
    elif int_number % 10 == 9:
       e = " девять учебных заданий"
    elif int_number % 10 == 0:
       e = " учебных заданий"
    print(q + w + e)
    return q + w + e

def elif18(int_number):
    """
    Elif18. Дано целое число в диапазоне 100–999. Вывести строку-описание данного числа,
    например: 256 - «двести пятьдесят шесть», 814 - «восемьсот четырнадцать».
    """
    if int_number // 100 == 1:
       q = "сто"
    elif int_number // 100 == 2:
       q = "двести"
    elif int_number // 100 == 3:
       q = "триста"
    elif int_number // 100 == 4:
       q = "четыреста"
    elif int_number // 100 == 5:
       q = "пятьсот"
    elif int_number // 100 == 6:
       q = "шестьсот"
    elif int_number // 100 == 7:
       q = "семьсот"
    elif int_number // 100 == 8:
       q = "восемьсот"
    elif int_number // 100 == 9:
       q = "девятьсот"

    if int_number % 100 // 10 == 0:
        q +=""
    elif int_number % 100 // 10 == 2:
       q += "двадцать"
    elif int_number % 100 // 10 == 3:
       q += "тридцать"
    elif int_number % 100 // 10 == 4:
       q += "сорок"
    elif int_number % 100 // 10 == 5:
       q += "пятьдесят"
    elif int_number % 100 // 10 == 6:
       q += "шестьдесят"
    elif int_number % 100 // 10 == 7:
       q += "семьдесят"
    elif int_number % 100 // 10 == 8:
       q += "восемдесят"
    elif int_number % 100 // 10 == 9:
       q += "девяносто"

    elif int_number % 100 == 10:
       q += "десять"
    elif int_number % 100 == 11:
       q += "одиннадцать"
    elif int_number % 100 == 12:
       q += "двенадцать"
    elif int_number % 100 == 13:
       q += "тринадцать"
    elif int_number % 100 == 14:
       q += "четырнадцать"
    elif int_number % 100 == 15:
       q += "пятнадцать"
    elif int_number % 100 == 16:
       q += "шестнадцать"
    elif int_number % 100 == 17:
       q += "семнадцать"
    elif int_number % 100 == 18:
       q += "восемнадцать"
    elif int_number % 100 == 19:
       q += "девятнадцать"

    if int_number % 10 == 0 and int_number % 100 // 10 != 1:
        q += ""
    elif int_number % 10 == 1 and int_number % 100 // 10 != 1:
       q += "один"
    elif int_number % 10 == 2 and int_number % 100 // 10 != 1:
       q += "два"
    elif int_number % 10 == 3 and int_number % 100 // 10 != 1:
       q += "три"
    elif int_number % 10 == 4 and int_number % 100 // 10 != 1:
       q += "четыре"
    elif int_number % 10 == 5 and int_number % 100 // 10 != 1:
       q += "пять"
    elif int_number % 10 == 6 and int_number % 100 // 10 != 1:
       q += "шесть"
    elif int_number % 10 == 7 and int_number % 100 // 10 != 1:
       q += "семь"
    elif int_number % 10 == 8 and int_number % 100 // 10 != 1:
       q += "восемь"
    elif int_number % 10 == 9 and int_number % 100 // 10 != 1:
       q += "девять"
    return q


def elif19(year):
    """
    Elif19. В восточном календаре принят 60-летний цикл, состоящий из 12-летних под-циклов,
    обозначаемых названиями цвета: зеленый, красный, желтый, белый и черный. В каждом подцикле годы носят
    названия животных: крысы, коровы, тигра, зайца, дракона, змеи, лошади, овцы, обезьяны, курицы, собаки и свиньи.
    По номеру года определить его название, если 1984 год - начало цикла: «год зеленой крысы».
    """
    if year % 10 == 0 or year % 10 == 1:
       q = "год бело"
    elif year % 10 == 2 or year % 10 == 3:
       q = "год голубо"
    if year % 10 == 4 or year % 10 == 5:
       q = "год зелено"
    if year % 10 == 6 or year % 10 == 7:
       q = "год красно"
    if year % 10 == 8 or year % 10 == 9:
       q = "год желто"

    if year % 12 == 0:
       q += "й обезьяны"
    elif year % 12 == 1:
       q += "го петуха"
    elif year % 12 == 2:
       q += "й собаки"
    elif year % 12 == 3:
       q += "й свиньи"
    elif year % 12 == 4:
       q += "й крысы"
    elif year % 12 == 5:
       q += "го быка"
    elif year % 12 == 6:
       q += "го тигра"
    elif year % 12 == 7:
       q += "го кролика"
    elif year % 12 == 8:
       q += "го дракона"
    elif year % 12 == 9:
       q += "й змеи"
    elif year % 12 == 10:
       q += "й лошади"
    elif year % 12 == 10:
       q += "й овцы"


def elif20(day, month):
    """
    Elif20. Даны два целых числа: day (день) и month (месяц), определяющие правильную дату.
    Вывести знак Зодиака, соответствующий этой дате: «Водолей» (20.1–18.2), «Рыбы» (19.2–20.3), «Овен» (21.3–19.4),
    «Телец» (20.4–20.5), «Близнецы» (21.5–21.6), «Рак» (22.6–22.7), «Лев» (23.7–22.8), «Дева» (23.8–22.9),
    «Весы» (23.9–22.10), «Скорпион» (23.10–22.11), «Стрелец» (23.11–21.12), «Козерог» (22.12–19.1)
    """
    index = month * 100 + day
    if 120 <= index <= 218:
       q = "Водолей"
    elif 219 <= index <= 320:
       q = "Рыбы"
    elif 321 <= index <= 419:
       q = "Овен"
    elif 420 <= index <= 520:
       q = "Телец"
    elif 521 <= index <= 621:
       q = "Близнецы"
    elif 622 <= index <= 722:
       q = "Рак"
    elif 723 <= index <= 822:
       q = "Лев"
    elif 823 <= index <= 922:
       q = "Дева"
    elif 923 <= index <= 1022:
       q = "Весы"
    elif 1023 <= index <= 1122:
       q = "Скорпион"
    elif 1123 <= index <= 1221:
       q = "Стрелец"
    elif 1222 <= index <= 1231 or 101 <= index <= 129:
       q = "Козерог"
    else:
       q = 0
    return q